/*
 * 版权所有(c) 2022 - 2022
 * 项目名称: alisdy -- 文件名称: operator.java
 * Date: 2022/6/20 下午2:20
 * Author: yijie
 */

package com.ase;

public class operator {
    public static void main(String[] args) {
//        运算符：
//            数学运算符：四则运算（+，-，*，/） 简化运算符（+=，-=，*=，/=等）
//                ++（），--（）
//                关系运算符：大于，小于，大于等于，小于等于，不等于，相等（==）
//                    逻辑运算： 三目运算符（关系运算？运算满足时的内容：关系不满足时的内容）
//                        也可以进行嵌套（可读性很差）
//                        位运算：直接进行二进制处理 与（&） ，或 （|）,异或 （）， 反码
//
//

    }
}
